This operation will convert the existing axis of revolution to a normal line.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ConvertingOldAxisToNormal { get; }
  Visual Basic
Public Shared ReadOnly Property ConvertingOldAxisToNormal As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ConvertingOldAxisToNormal {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeneralFailures Class
  Autodesk.Revit.DB Namespace